uhnp/src/InformationRegisters/ПараметрыЛимитированияВалютыЦФО/ПараметрыЛимитированияВалютыЦФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитированияВалютыЦФО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УдалитьПараметрыЛимитированияЦФО/УдалитьПараметрыЛимитированияЦФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьПараметрыЛимитированияЦФО</name>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПараметрыЛимитированияВалютыЦФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновления

// Процедура заполняет регистр при первоначальном заполнении информационной базы
Процедура ПервоначальноеЗаполнение() Экспорт

	// Заполнить РегистрСведений.ПараметрыЛимитирования
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяВалюта", КэшируемыеПроцедурыОПК.ПустаяВалюта());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК ЦФО,
	|	Организации.Удалить_ФункциональнаяВалюта КАК ВалютаЛимитирования
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьПараметрыЛимитированияЦФО КАК ПараметрыЛимитированияЦФО
	|		ПО Организации.Ссылка = ПараметрыЛимитированияЦФО.ЦФО
	|ГДЕ
	|	Организации.Удалить_ФункциональнаяВалюта <> &ПустаяВалюта
	|	И ПараметрыЛимитированияЦФО.ЦФО ЕСТЬ NULL";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.ПараметрыЛимитированияВалютыЦФО.СоздатьНаборЗаписей();
		НЗ.Отбор.ЦФО.Установить(Выборка.ЦФО);
		ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НЗ,,, Истина);
	КонецЦикла;
	
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти


#КонецЕсли
